activagrogps/esp32-xbee/sdkconfig.defaults.esp32s3
# 1. Target the S3 Chip
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# 2. Flash Size (4MB is standard for S3)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# 3. Use Custom Partition Table (The Fix!)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 4. Pin Definitions (RTK Wiring)
CONFIG_XBEE_UART_TX_GPIO=17
CONFIG_XBEE_UART_RX_GPIO=18

# 5. Enable mDNS
CONFIG_MDNS_ENABLED=y
